<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $permissions = [
            // --- عامة ---
            'إدارة المستخدمين',
            'تعيين صلاحيات الموظفين',
            'إنشاء مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',
            'تغيير كلمة مرور المستخدم',
            'عرض سجل النشاطات',
            'تصدير التقارير',
            'أرشفة البيانات',
            'عرض لوحة التحكم',

            // --- الديوان ---
            'انشاء حساب موظف الديوان',
            'تعديل حساب موظف الديوان',
            'عرض كل الموظفين في الدائرة',
            'ادخال معاملة جديدة بشكل يدوي',
            'ادخال معاملة جديدة بصيغة وورد',
            'الغاء تفعيل حساب الموظف',
            'عرض البريد الداخلي الصادر',
            'عرض البريد الداخلي الوارد',
            'عرض البريد الخارجي الصادر',
            'عرض البريد الخارجي الوارد',
            'عرض كافةاستمارات المعاملات',
            'الغاء تفعيل استمارة المعاملة',
            'عرض المعاملة',
            'بحث عن معاملة',
            'عرض البريد الداخلي',
            'عرض عدد المعاملات المنجزة من قبل كل موظف',
            'عرض تفاصيل احصائية بالبريد الخارجي',
            'عرض تفاصيل احصائية بالبريد الداخلي',
            'عرض المعاملات المنجزة لهذا الاسبوع',
            'انشاء بريد داخلي',
            'الموافقة على البريد الداخلي',
            'رفض البريد الداخلي',
            'ارسال المعاملة للدائرة التالية',
            'قبول البريد',
            'رفض البريد',
            'أرشفة المعاملات',
            'رفض المعاملة',
            'عرض الارشيف',
            'الاشعارات',

            // المالية
            'عرض ايصال الدفع',
            'رفض الايصال',
            'تأكيد الايصال',
            'انشاء حساب موظف المالية',
            'تعديل حساب موظف المالية',
            // --- المجالس العلمية ---
            'انشاء حساب موظف المجالس العلمية',
            'تعديل حساب موظف المجالس العلمية',

            // --- الشهادات ---
            'انشاء حساب موظف الشهادات',
            'تعديل حساب موظف الشهادات',

            // --- الامتحانات ---
            'انشاء حساب موظف امتحانات',
            'تعديل حساب موظف امتحانات',
            'إضافة اختصاص',
            'عرض كل الاختصاصات',
            'عرض علامات الاطباء',
            'إضافة برنامج امتحان',
            'عرض برنامج الامتحان',
            'عرض برامج الامتحانات',
            'إضافة سؤال لبنك الأسئلة',
            'عرض طلبات الامتحان المنتهية',
            'عرض طلبات الامتحان الواردة',
            'عرض تفاصيل المرشحين للامتحان',
            'عرض تفاصيل المتقدمين للامتحان',
            'عرض تفاصيل الطلب',
            'قبول طلب الامتحان',
            'رفض طلب الامتحان',

            // --- الإقامة ---
            'انشاء حساب موظف الإقامة',
            'تعديل حساب موظف الإقامة',

            // --- المفاضلة ---
            'انشاء حساب موظف المفاضلة',
            'تعديل حساب موظف المفاضلة',

            // --- المدير العام ---
            'عرض كل الموظفين',
            'عرض ارشيف كل دائرة',
            'تحديد أوقات عمل المنصة',
            'عرض إنجاز الدوائر للمعاملات',
            'عرض الاحصائيات الاسبوعية لكل دائرة',
            'عرض اوقات و ايام العمل على النظام',
            'الموافقة على برنامج امتحان',
            'رفض برنامج امتحان',
            'الموافقة على استمارة معاملة',
            'رفض استمارة معاملة',


            // --- نائب المدير ---
            'تعديل حسابات رؤساء الأقسام',
            'انشاء حسابات رؤساء الاقسام',
            'عرض احصائية بإنجاز كل الموظفين في كل الاقسام',


            // --- الطبيب ---
            'التسجيل في التطبيق',
            'تعديل المعلومات الشخصية',
            'عرض نتائج الامتحانات',
            'تسجيل الدخول للامتحان',
            'عرض اسئلة الامتحان',
            'عرض العلامة النهائية',
            'عرض الوقت المتبقي للامتحان',
            'إمكانية إنهاء الامتحان',
            'تسجيل الخروج من الامتحان',
            'تقديم طلب امتحان داخل القطر',
            'تقديم طلب امتحان خارج القطر',
            'تقديم طلب اعتذار عن الامتحان',
            'متابعة حالة الطلب',
            'تقديم معاملات',
            'متابعة مسار المعاملة',
        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate(['name' => $permission]);
        }
    }
}
