<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Role;
use Spatie\Permission\Models\Permission;

class Role_PermissionSeeder extends Seeder
{
    public function run(): void
    {
        // جلب كل الصلاحيات دفعة واحدة
        $allPermissions = Permission::all()->pluck('name')->toArray();

        // المدير => كل الصلاحيات
        $admin = Role::where('name', 'المدير')->first();
        if ($admin) {
            $admin->syncPermissions([
                'عرض كل الموظفين',
                'عرض ارشيف كل دائرة',
                'تحديد أوقات عمل المنصة',
                'عرض إنجاز الدوائر للمعاملات',
                'عرض الاحصائيات الاسبوعية لكل دائرة',
                'عرض اوقات و ايام العمل على النظام',
                'الموافقة على برنامج امتحان',
                'رفض برنامج امتحان',
                'الموافقة على استمارة معاملة',
                'رفض استمارة معاملة',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'انشاء بريد داخلي',
                'ارسال المعاملة للدائرة التالية',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض كل الاختصاصات',
                'عرض علامات الاطباء',
                'عرض برنامج الامتحان',
                'عرض برامج الامتحانات',
                'عرض تفاصيل المرشحين للامتحان',
                'عرض تفاصيل المتقدمين للامتحان',

            ]);
        }

        // نائب المدير => صلاحيات نائب المدير فقط
        $deputy = Role::where('name', 'نائب المدير')->first();
        if ($deputy) {
            $deputy->syncPermissions([
                'تعديل حسابات رؤساء الأقسام',
                'انشاء حسابات رؤساء الاقسام',
                'عرض احصائية بإنجاز كل الموظفين في كل الاقسام',
                'عرض ارشيف كل دائرة',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'انشاء بريد داخلي',
                'ارسال المعاملة للدائرة التالية',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض كل الاختصاصات',
                'عرض علامات الاطباء',
                'عرض برنامج الامتحان',
                'عرض برامج الامتحانات',
                'عرض تفاصيل المرشحين للامتحان',
                'عرض تفاصيل المتقدمين للامتحان',

            ]);
        }

        // رئيس الديوان
        $headFrontDesk = Role::where('name', 'رئيس الديوان')->first();
        if ($headFrontDesk) {
            $headFrontDesk->syncPermissions([
                'انشاء حساب موظف الديوان',
                'تعديل حساب موظف الديوان',
                'عرض كل الموظفين في الدائرة',
                'ادخال معاملة جديدة بشكل يدوي',
                'ادخال معاملة جديدة بصيغة وورد',
                'الغاء تفعيل حساب الموظف',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض كافةاستمارات المعاملات',
                'الغاء تفعيل استمارة المعاملة',
                'عرض المعاملة',
                'عرض البريد الداخلي',
                'الموافقة على البريد الداخلي',
                'رفض البريد الداخلي',
                'عرض عدد المعاملات المنجزة من قبل كل موظف',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض المعاملات المنجزة لهذا الاسبوع',
                'بحث عن معاملة',
                'عرض الارشيف',
                'الاشعارات',
            ]);
        }

        // موظف الديوان
        $frontDesk = Role::where('name', 'موظف الديوان')->first();
        if ($frontDesk) {
            $frontDesk->syncPermissions([
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'انشاء بريد داخلي',
                'ارسال المعاملة للدائرة التالية',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
            ]);
        }

        // رئيس المالية
        $headFinance = Role::where('name', 'رئيس المالية')->first();
        if ($headFinance) {
            $headFinance->syncPermissions([
                'انشاء حساب موظف المالية',
                'تعديل حساب موظف المالية',
                'عرض كل الموظفين في الدائرة',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'عرض عدد المعاملات المنجزة من قبل كل موظف',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض المعاملات المنجزة لهذا الاسبوع',
                'الموافقة على البريد الداخلي',
                'رفض البريد الداخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'عرض الارشيف',
                'عرض ايصال الدفع',
                'الاشعارات',
            ]);
        }

        // موظف المالية
        $finance = Role::where('name', 'موظف المالية')->first();
        if ($finance) {
            $finance->syncPermissions([
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'ارسال المعاملة للدائرة التالية',
                'انشاء بريد داخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'عرض ايصال الدفع',
                'رفض الايصال',
                'تأكيد الايصال',
                'الاشعارات',
            ]);
        }

        // رئيس المجالس العلمية
        $headAcademic = Role::where('name', 'رئيس مجالس علمية')->first();
        if ($headAcademic) {
            $headAcademic->syncPermissions([
                'انشاء حساب موظف المجالس العلمية',
                'تعديل حساب موظف المجالس العلمية',
                'عرض كل الموظفين في الدائرة',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'عرض عدد المعاملات المنجزة من قبل كل موظف',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض المعاملات المنجزة لهذا الاسبوع',
                'الموافقة على البريد الداخلي',
                'رفض البريد الداخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'عرض الارشيف',
                'الاشعارات',
            ]);
        }

        // موظف المجالس العلمية
        $academic = Role::where('name', 'موظف مجالس علمية')->first();
        if ($academic) {
            $academic->syncPermissions([
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'ارسال المعاملة للدائرة التالية',
                'انشاء بريد داخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
            ]);
        }

        // رئيس الشهادات
        $headCert = Role::where('name', 'رئيس الشهادات')->first();
        if ($headCert) {
            $headCert->syncPermissions([
                'انشاء حساب موظف الشهادات',
                'تعديل حساب موظف الشهادات',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'عرض عدد المعاملات المنجزة من قبل كل موظف',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض المعاملات المنجزة لهذا الاسبوع',
                'الموافقة على البريد الداخلي',
                'رفض البريد الداخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'عرض الارشيف',
                'الاشعارات',
            ]);
        }

        // موظف الشهادات
        $cert = Role::where('name', 'موظف الشهادات')->first();
        if ($cert) {
            $cert->syncPermissions([
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'ارسال المعاملة للدائرة التالية',
                'انشاء بريد داخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
            ]);
        }

        // رئيس الامتحانات
        $headExam = Role::where('name', 'رئيس الامتحانات')->first();
        if ($headExam) {
            $headExam->syncPermissions([
                'انشاء حساب موظف امتحانات',
                'تعديل حساب موظف امتحانات',
                'عرض كل الموظفين في الدائرة',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'عرض عدد المعاملات المنجزة من قبل كل موظف',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض المعاملات المنجزة لهذا الاسبوع',
                'الموافقة على البريد الداخلي',
                'رفض البريد الداخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'عرض الارشيف',
                'الاشعارات',
                'إضافة اختصاص',
                'عرض كل الاختصاصات',
                'عرض علامات الاطباء',
                'إضافة برنامج امتحان',
                'عرض برنامج الامتحان',
                'عرض برامج الامتحانات',
                'إضافة سؤال لبنك الأسئلة',
                'عرض طلبات الامتحان المنتهية',
                'عرض طلبات الامتحان الواردة',
                'عرض تفاصيل المرشحين للامتحان',
                'عرض تفاصيل المتقدمين للامتحان',
                'عرض تفاصيل الطلب',
            ]);
        }

        // موظف الامتحانات
        $exam = Role::where('name', 'موظف الامتحانات')->first();
        if ($exam) {
            $exam->syncPermissions([
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'ارسال المعاملة للدائرة التالية',
                'انشاء بريد داخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
                'عرض كل الاختصاصات',
                'عرض علامات الاطباء',
                'عرض برنامج الامتحان',
                'عرض برامج الامتحانات',
                'عرض طلبات الامتحان المنتهية',
                'عرض طلبات الامتحان الواردة',
                'عرض تفاصيل المرشحين للامتحان',
                'عرض تفاصيل المتقدمين للامتحان',
                'عرض تفاصيل الطلب',
                'قبول طلب الامتحان',
                'رفض طلب الامتحان',
            ]);
        }

        // رئيس الإقامة
        $headResidency = Role::where('name', 'رئيس الإقامة')->first();
        if ($headResidency) {
            $headResidency->syncPermissions([
                'انشاء حساب موظف الإقامة',
                'تعديل حساب موظف الإقامة',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'عرض عدد المعاملات المنجزة من قبل كل موظف',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض المعاملات المنجزة لهذا الاسبوع',
                'الموافقة على البريد الداخلي',
                'رفض البريد الداخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'عرض الارشيف',
                'الاشعارات',
            ]);
        }

        // موظف الإقامة
        $residency = Role::where('name', 'موظف الإقامة')->first();
        if ($residency) {
            $residency->syncPermissions([
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'ارسال المعاملة للدائرة التالية',
                'انشاء بريد داخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
            ]);
        }

        // رئيس المفاضلة
        $headSelection = Role::where('name', 'رئيس المفاضلة')->first();
        if ($headSelection) {
            $headSelection->syncPermissions([
                'انشاء حساب موظف المفاضلة',
                'تعديل حساب موظف المفاضلة',
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'عرض البريد الداخلي',
                'عرض عدد المعاملات المنجزة من قبل كل موظف',
                'عرض تفاصيل احصائية بالبريد الخارجي',
                'عرض تفاصيل احصائية بالبريد الداخلي',
                'عرض المعاملات المنجزة لهذا الاسبوع',
                'الموافقة على البريد الداخلي',
                'رفض البريد الداخلي',
                'بحث عن معاملة',
                'عرض المعاملة',
                'عرض الارشيف',
                'الاشعارات',
            ]);
        }

        // موظف المفاضلة
        $selection = Role::where('name', 'موظف المفاضلة')->first();
        if ($selection) {
            $selection->syncPermissions([
                'عرض البريد الداخلي الوارد',
                'عرض البريد الداخلي الصادر',
                'عرض البريد الخارجي الصادر',
                'عرض البريد الخارجي الوارد',
                'انشاء بريد داخلي',
                'عرض البريد الداخلي',
                'ارسال المعاملة للدائرة التالية',
                'بحث عن معاملة',
                'عرض المعاملة',
                'رفض المعاملة',
                'الاشعارات',
            ]);
        }

        // الطبيب
        $doctor = Role::where('name', 'الطبيب')->first();
        if ($doctor) {
            $doctor->syncPermissions([
                'التسجيل في التطبيق',
                'تعديل المعلومات الشخصية',
                'عرض نتائج الامتحانات',
                'تسجيل الدخول للامتحان',
                'عرض اسئلة الامتحان',
                'عرض العلامة النهائية',
                'عرض الوقت المتبقي للامتحان',
                'إمكانية إنهاء الامتحان',
                'تسجيل الخروج من الامتحان',
                'تقديم طلب امتحان داخل القطر',
                'تقديم طلب امتحان خارج القطر',
                'تقديم طلب اعتذار عن الامتحان',
                'متابعة حالة الطلب',
                'تقديم معاملات',
                'متابعة مسار المعاملة',
            ]);
        }
    }
}
